Repository: NizamHakim/icar
Catalog: lib/src/l10n/ticket/ticket_*.arb
Languages: id

# myQueueScreenTitle
source: My Queue
id: Antrean Saya

# ticketStatus
source: {status, select, IN_QUEUE{In Queue} CANCELED{Canceled} FINISHED{Finished} other{Unknown value}}
id: {status, select, IN_QUEUE{Dalam antrean} CANCELED{Dibatalkan} FINISHED{Selesai} other{Unknown value}}

# noTicketsByStatus
source: {status, select, IN_QUEUE{No tickets in queue} CANCELED{No tickets canceled} FINISHED{No tickets finished} other{Unknown value}}
id: {status, select, IN_QUEUE{Tidak ada tiket dalam antrean} CANCELED{Tidak ada tiket dibatalkan} FINISHED{Tidak ada tiket selesai} other{Unknown value}}

# ticketDetailsScreenTitle
source: Queue Ticket
id: Tiket Antrean

source: Expired at
id: Berlaku sampai

# cancelTicketButtonLabel
source: Cancel queue
id: Batalkan antrean

# ticketInfoTitle
source: {infoType, select, CLOSE{iCar is nearby!} ARRIVED{iCar has arrived at the stop!} other{Unknown value}}
id: {infoType, select, CLOSE{iCar sudah dekat!} ARRIVED{iCar tiba di halte!} other{Unknown value}}

# ticketInfoDescription
source: {infoType, select, CLOSE{iCar will be arrived in couple of minutes. Lets go to the stop!} ARRIVED{Let's get to the iCar or queue for another time if it's fully occupied!} other{Unknown value}}
id: {infoType, select, CLOSE{iCar sampai dalam beberapa menit. Ayo pergi ke halte!} ARRIVED{Ayo naik iCar atau antre di waktu lain kalau iCar penuh!} other{Unknown value}}

source: Queue ticket canceled
id: Tiket antrean dibatalkan

source: iCar has arrived
id: iCar sudah tiba

source: What do you think?
id: Bagaimana pendapatmu?

source: What is good?
id: Apa yang sudah bagus?

source: What should be improved?
id: Apa yang perlu ditingkatkan?

# reviewOptions
source: {review, select, PUNCTUALITY{Punctuality} TRAVEL_SAFETY{Travel safety} COMFORT{Comfort} CLEANLINESS{Cleanliness} TRAVEL_SPEED{Travel speed} APPLICATION_SERVICE{Application service} NUMBER_OF_SEATS{Number of seats} TRAVEL_ROUTE{Travel route} NUMBER_OF_STOPS{Number of stops} other{Unknown value}}
id: {review, select, PUNCTUALITY{Ketepatan jadwal} TRAVEL_SAFETY{Keamanan perjalanan} COMFORT{Kenyamanan} CLEANLINESS{Kebersihan} TRAVEL_SPEED{Kecepatan} APPLICATION_SERVICE{Layanan aplikasi} NUMBER_OF_SEATS{Jumlah kursi} TRAVEL_ROUTE{Rute perjalanan} NUMBER_OF_STOPS{Jumlah halte} other{Unknown value}}

source: Any other suggestion?
id: Ada saran lain?

source: Enter suggestion...
id: Masukkan saran...

# cancelTicketDialogTitle
source: Cancel iCar Queue
id: Batalkan Antrean iCar

# cancelTicketDialogDesc
source: This action will cancel your ticket permanently. Are you sure?
id: Perlu diingat bahwa pembatalan ini bersifat permanen. Apakah anda ingin melanjutkan?

# cancelTicketDialogSubmit
source: Cancel queue
id: Batalkan antrean

# cancelTicketDialogCancel
source: Stay on queue
id: Tetap antre

# ticketCreateSuccess
source: Ticket created successfully
id: Tiket berhasil dibuat

# ticketUpdateSuccess
source: Ticket updated successfully
id: Tiket berhasil di update

# reviewUpdateSuccess
source: Review updated successfully
id: Review berhasil di update
