Repository: NizamHakim/icar
Catalog: lib/src/l10n/home/home_*.arb
Languages: id

# checkQueueLabelStop
source: Stop
id: Halte

# checkQueueLabelRoute
source: Route
id: Rute

# checkQueueHintStop
source: Select a stop
id: Pilih halte

# checkQueueHintRoute
source: Select a route
id: Pilih rute

# checkQueueSubmitButton
source: Check iCar queue
id: Cek antrean iCar

# selectStopLabelLatestSearch
source: Latest search
id: Pencarian terbaru

# selectStopLabelAllOptions
source: Stops
id: Halte

# selectStopFindStopHint
source: Find a stop...
id: Cari halte...

# selectStopNoStopMatched
source: No suitable stops matched
id: Tidak ada halte yang cocok

# noUpcomingTicket
source: No upcoming ticket in queue
id: Tidak ada tiket antrian yang akan datang

source: View all
id: Lihat semua
